# -*- coding: utf-8 -*-
'''
Задание 5.2

Запросить у пользователя ввод IP-сети в формате: 10.1.1.0/24

Затем вывести информацию о сети и маске в таком формате:

Network:
10        1         1         0
00001010  00000001  00000001  00000000

Mask:
/24
255       255       255       0
11111111  11111111  11111111  00000000

Проверить работу скрипта на разных комбинациях сеть/маска.

Ограничение: Все задания надо выполнять используя только пройденные темы.
'''

x = input('vvedite adress v formate 10.1.1.0/24 :')
x=x.split('/')
ip=x[0].split('.')
mask=int(x[1])*'1'+(32-int(x[1]))*'0'


vuvod_n='''
Network:
{0:<8} {1:<8} {2:<8} {3:<8}
{0:08b} {1:08b} {2:08b} {3:08b}
'''
vuvod_m='''
Mask:
{}
{:<8} {:<8} {:<8} {:<8}
{} {} {} {}
'''
print(vuvod_n.format(int(ip[0]),int(ip[1]),int(ip[2]),int(ip[3])))
print(vuvod_m.format('/'+x[1],int(mask[:8],2),int(mask[8:16],2),int(mask[16:24],2),int(mask[24:],2),mask[:8],mask[8:16],mask[16:24],mask[24:]))

