# -*- coding: utf-8 -*-
'''
Задание 5.2a

Всё, как в задании 5.2. Но, если пользователь ввел адрес хоста, а не адрес сети,
то надо адрес хоста преобразовать в адрес сети и вывести адрес сети и маску, как в задании 5.2.

Пример адреса сети (все биты хостовой части равны нулю):
* 10.0.1.0/24
* 190.1.0.0/16

Пример адреса хоста:
* 10.0.1.1/24 - хост из сети 10.0.1.0/24
* 10.0.5.1/30 - хост из сети 10.0.5.0/30

Если пользователь ввел адрес 10.0.1.1/24,
вывод должен быть таким:

Network:
10        0         1         0
00001010  00000000  00000001  00000000

Mask:
/24
255       255       255       0
11111111  11111111  11111111  00000000

Проверить работу скрипта на разных комбинациях сеть/маска.

Ограничение: Все задания надо выполнять используя только пройденные темы.

'''
x = input('vvedite adress v formate 10.1.1.0/24 :')
x=x.split('/')
ip=x[0].split('.')
ip=[int(ip[0]),int(ip[1]),int(ip[2]),int(ip[3])]
mask=int(x[1])*'1'+(32-int(x[1]))*'0'
ip_b='{:08b}{:08b}{:08b}{:08b}'.format(ip[0],ip[1],ip[2],ip[3])
ip_s=ip_b[:int(x[1])]+(32-int(x[1]))*'0'
print(ip_s)

vuvod_n='''
Network:
{0:<8d} {1:<8d} {2:<8d} {3:<8d}
{0:08b} {1:08b} {2:08b} {3:08b}
'''
vuvod_m='''
Mask:
{}
{:<8} {:<8} {:<8} {:<8}
{} {} {} {}
'''
print(vuvod_n.format(int(ip_s[:8],2),int(ip_s[8:16],2),int(ip_s[16:24],2),int(ip_s[24:32],2)))
print(vuvod_m.format('/'+x[1],int(mask[:8],2),int(mask[8:16],2),int(mask[16:24],2),int(mask[24:],2),mask[:8],mask[8:16],mask[16:24],mask[24:]))
