# -*- coding: utf-8 -*-
'''
Задание 4.7

Преобразовать MAC-адрес mac в двоичную строку такого вида:
'101010101010101010111011101110111100110011001100'

Ограничение: Все задания надо выполнять используя только пройденные темы.

'''
mac = 'AAAA:BBBB:CCCC'

mac1 = bin(int(mac[0:2],16))

mac1 = bin(int(mac[2:4],16))
mac2 = bin(int(mac[5:7],16))
mac3 = bin(int(mac[7:9],16))
mac4 = bin(int(mac[10:12],16))
mac5 = bin(int(mac[12:14],16))
mac = mac1[2:]+mac2[2:]+mac3[2:]+mac4[2:]+mac5[2:]
print(mac)
